dotemacs.org
* File: inits/40-company.el
#+begin_src emacs-lisp :tangle inits/40-company.el
;; Modular in-buffer completion framework for Emacs
;; http://company-mode.github.io/

(defun my-shell-mode-setup-function ()
  (when (and (fboundp 'company-mode)
             (file-remote-p default-directory))
    (company-mode -1)))

(use-package company
  :diminish company-mode
  :after eglot
  :straight t
  :config
  (add-hook 'after-init-hook 'global-company-mode)
  ;; Disable company-mode if in a remote shell due to slow performance
  (add-hook 'shell-mode-hook 'my-shell-mode-setup-function)
  (add-to-list 'company-backends 'company-capf)

  (setq
   company-echo-delay 0
   company-idle-delay 0.2
   company-show-numbers t
   company-minimum-prefix-length 1
   company-tooltip-align-annotations t
   company-minimum-prefix-length 1
   company-tooltip-limit 20)
  :bind
  (:map company-active-map
        ("C-n". company-select-next)
        ("C-p". company-select-previous)
        ("M-<". company-select-first)
        ("M->". company-select-last)))


(use-package company-quickhelp
  :ensure t
  :config
  (company-quickhelp-mode 1))

;; Ansible keywords completion for Emacs
;; https://github.com/krzysztof-magosa/company-ansible
(use-package company-ansible :straight t)

;; Auto-completion for C/C++ headers using Company
;; https://github.com/randomphrase/company-c-headers
(use-package company-c-headers
  :straight t
  :init
  (add-hook 'c-mode-common-hook
            (lambda ()
              (when (derived-mode-p 'c-mode 'c++-mode)
                (add-to-list 'company-backends 'company-c-headers)))))

;; company-mode completion back-end for irony-mode
;; https://github.com/Sarcasm/company-irony
(use-package company-irony
  :straight t
  :init
  (add-hook 'c-mode-common-hook
            (lambda ()
              (when (derived-mode-p 'c-mode 'c++-mode)
                (progn
                  (add-to-list 'company-backends 'company-irony)
                  (irony-mode))))))

;; Python auto-completion for Emacs
;; http://tkf.github.io/emacs-jedi/latest/
;; Requires: `pip install jedi`
;; Company backend for Python jedi
;; https://github.com/syohex/emacs-company-jedi
(use-package company-jedi
  :straight t
  :init
  (setq-default
   jedi:complete-on-dot t
   jedi:get-in-function-call-delay 0.2))

(use-package company-lua :straight t)

;; https://github.com/rafalcieslak/emacs-company-terraform
(use-package company-terraform :straight t)

#+end_src

* File: inits/40-eaf.el
#+begin_src emacs-lisp :tangle inits/40-eaf.el
;; TODO: Cannot open org-mode files in remote drives with EAF enabled. Test before re-enabling.
;;
;; (straight-use-package-lazy
;;  `(eaf :type git
;;        :host github
;;        :repo "emacs-eaf/emacs-application-framework"
;;        :files ("*.el" "*.py" "*.js" "*.html" "*.json" "core" "app" "node_modules")
;;        :build t
;;        :pre-build ,(pcase system-type
;;                        ('gnu/linux '(("./install-eaf.py" "--ignore-core-deps" "--ignore-sys-deps" "--ignore-py-deps" "--install-all-apps")))
;;                        (_          '(;; ("python" "./install-eaf.py" "--ignore-core-deps" "--ignore-sys-deps" "--ignore-py-deps" "--install-all-apps")
;;                                      )))))


;; (use-package eaf
;;     :straight t
;;     :after org
;;     :defines (eaf-browser-enable-adblocker
;;               eaf-open-browser)
;;     :functions (eaf-setq
;;                 eaf-bind-key)
;;     :init
;;     (use-package epc
;;         :straight t
;;         :defer t)
;;     (use-package ctable
;;         :straight t
;;         :defer t )
;;     (use-package deferred
;;         :straight t
;;         :defer t)
;;     (use-package s
;;         :straight t
;;         :defer t)

;;     :custom
;;     (eaf-browser-continue-where-left-off t)

;;     :init

;;     :config
;;     (when (eq system-type 'gnu/linux)
;;         (require 'eaf-browser)
;;         (require 'eaf-org-previewer)
;;         (require 'eaf-markdown-previewer)
;;         (eaf-setq eaf-browser-enable-adblocker "true")))

(provide '40-eaf)

#+end_src

* File: inits/40-eglot.el
#+begin_src emacs-lisp :tangle inits/40-eglot.el
;; LSP Integration
(use-package eglot
  :init
  (fset #'jsonrpc--log-event #'ignore) ;; performance boost
  :straight t
  :hook (prog-mode . eglot-ensure)
  :bind (:map eglot-mode-map
              ("C-c h" . eldoc-doc-buffer)
              ("C-c l t" . eglot-find-typeDefinition)
              ("C-c l i" . eglot-find-implementation)
              ("C-c =" . eglot-format-buffer)
              ("C-c c" . eglot-completion-at-point)
              ("C-c r" . eglot-rename)
              ("C-c l a" . eglot-code-actions))
  :custom-face (eglot-highlight-symbol-face ((t (:inherit 'highlight :background "DimGray"))))

  :custom
  (eglot-events-buffer-size 0) ;; improved perf

  :config
  (setq read-process-output-max (* 1024 1024))
  ;; (push :documentHighlightProvider eglot-ignored-server-capabilities)
  ;; Enable LSP support by default in programming buffers
  ;; (add-hook 'prog-mode-hook #'eglot-ensure)

  (setq eldoc-echo-area-use-multiline-p t)
  (setq eldoc-documentation-strategy 'eldoc-documentation-compose-eagerly)
  (add-to-list 'eglot-server-programs '((c++-mode c-mode) "clangd"))
  (add-to-list 'eglot-server-programs '(toml-mode . ("taplo" "lsp")))
  (add-to-list 'eglot-server-programs '(toml-ts-mode . ("taplo" "lsp")))
  (add-to-list 'eglot-server-programs '(python-mode . ("pyright-langserver" "--stdio")))
  (add-to-list 'eglot-server-programs '(python-ts-mode . ("pyright-langserver" "--stdio"))) ;; TODO: figure out how to setup tree-sitter-modes properly with eglot
  )

(use-package eldoc-box
  :straight (:build t)
  :hook (prog-mode . eldoc-box-hover-at-point-mode)
  :after eldoc
  ;; TODO: figure out why keybinding scroll on box doesn't work
  ;; :general
  ;; (defun eldoc-box-scroll-up ()
  ;;   "Scroll up in `eldoc-box--frame'"
  ;;   (interactive)
  ;;   (with-current-buffer eldoc-box--buffer
  ;;     (with-selected-frame eldoc-box--frame
  ;;       (scroll-down 3))))
  ;; (defun eldoc-box-scroll-down ()
  ;;   "Scroll down in `eldoc-box--frame'"
  ;;   (interactive)
  ;;   (with-current-buffer eldoc-box--buffer
  ;;     (with-selected-frame eldoc-box--frame
  ;;       (scroll-up 3))))
  ;; (:keymaps 'eglot-mode-map
  ;;           :states '(insert normal hybrid motion visual operator emacs)
  ;;           "C-k" 'eldoc-box-scroll-up
  ;;           "C-j" 'eldoc-box-scroll-down)
  )


(use-package eglot-booster
  :straight (eglot-booster :type git :host github :repo "jdtsmith/eglot-booster")
  :after eglot
  :config (eglot-booster-mode))

(use-package flycheck-eglot
  :straight t
  :after (flycheck eglot)
  :config
  (global-flycheck-eglot-mode 1))

(provide '40-eglot)

#+end_src

* File: inits/40-ivy.el
#+begin_src emacs-lisp :tangle inits/40-ivy.el
(use-package ivy
  :straight t
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         :map ivy-reverse-i-search-map
         ("C-d" . ivy-reverse-i-search-kill))
  :init
  (ivy-mode 1)
  :config
  (setq ivy-use-virtual-buffers t)
  (setq ivy-wrap t)
  (setq ivy-count-format "(%d/%d) ")
  (setq enable-recursive-minibuffers t)

  ;; Use different regex strategies per completion command
  (push '(completion-at-point . ivy--regex-fuzzy) ivy-re-builders-alist)
  (push '(swiper . ivy--regex-ignore-order) ivy-re-builders-alist)
  (push '(counsel-M-x . ivy--regex-ignore-order) ivy-re-builders-alist)


  ;; Set minibuffer heght for different commands
  (setf (alist-get 'swiper ivy-height-alist) 15)
  (setf (alist-get 'counsel-switch-buffer ivy-height-alist) 7))

(use-package ivy-rich
  :straight t
  :init
  (ivy-rich-mode 1)
  :after counsel
  :config
  (setq ivy-format-function #'ivy-format-function-line)
  (setq ivy-rich-display-transformers-list
        (plist-put ivy-rich-display-transformers-list
                   'ivy-switch-buffer
                   '(:columns
                     ((ivy-rich-candidate (:width 40))
                      (ivy-rich-switch-buffer-indicators (:width 4 :face error :align right)); return the buffer indicators
                      (ivy-rich-switch-buffer-major-mode (:width 12 :face warning))          ; return the major mode info
                      (ivy-rich-switch-buffer-project (:width 15 :face success))             ; return project name using `projectile'
                      (ivy-rich-switch-buffer-path (:width (lambda (x) (ivy-rich-switch-buffer-shorten-path x (ivy-rich-minibuffer-width 0.3))))))))))  ; return file path relative to project root or `default-directory' if project is nil

(use-package counsel
  :straight t
  :bind (("M-x" . counsel-M-x)
         ("C-M-j" . counsel-switch-buffer)
         ;; ("C-x b" . counsel-ibuffer)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history))
  :config
  ;; these are a lot buggier on windows
  ;; TODO: investigate why
  (if (not (eq system-type 'windows-nt)) (bind-keys ("C-M-l" . counsel-imenu)
             ("C-x C-f" . counsel-find-file)
             ))
  (counsel-mode 1)
  ;; (setq ivy-initial-inputs-alist nil)
  ) ;; Don't start searches with ^

;; Improves sorting for fuzzy-matched results
(use-package flx
  :straight t
  :after ivy
  :defer t
  :init
  (setq ivy-flx-limit 10000))

(use-package wgrep
  :straight t)

(use-package ivy-posframe
  :straight t
  :disabled
  :custom
  (ivy-posframe-width 115)
  (ivy-posframe-min-width 115)
  (ivy-posframe-height 10)
  :config
  (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-center)))
  (setq ivy-posframe-parameters '((parent-frame . nil)
                                  (left-fringe . 8)
                                  (right-fringe . 8)))
  (ivy-posframe-mode 1))



(use-package swiper
  :straight t
  :after ivy
  :bind (("C-s" . swiper)
         ("C-r" . swiper)))

(provide '40-eglot)

#+end_src

