dotemacs.org
* File: inits/40-lazy-set-key.el
#+begin_src emacs-lisp :tangle inits/40-lazy-set-key.el
;;; lazy-set-key.el --- Lazy set keystroke.

;; Filename: 40-lazy-set-key.el
;; Description: Lazy set keystroke.
;; Author: Andy Stewart <lazycat.manatee@gmail.com>
;; Maintainer: Andy Stewart <lazycat.manatee@gmail.com>
;; Copyright (C) 2009, Andy Stewart, all rights reserved.
;; Created: 2009-02-07 22:32:50
;; Version: 0.1
;; Last-Updated: 2009-02-07 22:32:50
;;           By: Andy Stewart
;; URL: http://www.emacswiki.org/emacs/download/lazy-set-key.el
;; Keywords:
;; Compatibility: GNU Emacs 23.0.60.1
;;
;; Features that might be required by this library:
;;
;;
;;

;;; This file is NOT part of GNU Emacs

;;; License
;;
;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation; either version 3, or (at your option)
;; any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program; see the file COPYING.  If not, write to
;; the Free Software Foundation, Inc., 51 Franklin Street, Fifth
;; Floor, Boston, MA 02110-1301, USA.

;;; Commentary:
;;
;; Lazy set keystroke.
;;

;;; Installation:
;;
;; Put lazy-set-key.el to your load-path.
;; The load-path is usually ~/elisp/.
;; It's set in your ~/.emacs like this:
;; (add-to-list 'load-path (expand-file-name "~/elisp"))
;;
;; And the following to your ~/.emacs startup file.
;;
;; (require 'lazy-set-key)
;;
;; No need more.

;;; Change log:
;;
;; 2009/02/07
;;      * First released.
;;

;;; Acknowledgements:
;;
;;
;;

;;; TODO
;;
;;
;;

;;; Require


;;; Code:

(defun lazy-set-autoload-key (key-alist filename)
  (lazy-set-key key-alist)
  (dolist (element key-alist)
    (setq fun (cdr element))
    (autoload fun filename))
  )

(defun lazy-set-prefix-autoload-key (key-alist keymap key-prefix filename)
  (lazy-set-key key-alist keymap key-prefix)
  (dolist (element key-alist)
    (setq fun (cdr element))
    (autoload fun filename)))

(defun lazy-set-mode-autoload-key (key-alist keymap key-prefix filename)
  (lazy-set-key key-alist keymap key-prefix)
  (dolist (element key-alist)
    (setq fun (cdr element))
    (autoload fun filename))
  )

(defun lazy-set-key (key-alist &optional keymap key-prefix)
  "This function is to little type when define key binding.
`KEYMAP' is a add keymap for some binding, default is `current-global-map'.
`KEY-ALIST' is a alist contain main-key and command.
`KEY-PREFIX' is a add prefix for some binding, default is nil."
  (let (key def)
    (or keymap (setq keymap (current-global-map)))
    (if key-prefix
        (setq key-prefix (concat key-prefix " "))
      (setq key-prefix ""))
    (dolist (element key-alist)
      (setq key (car element))
      (setq def (cdr element))
      (cond ((stringp key) (setq key (read-kbd-macro (concat key-prefix key))))
            ((vectorp key) nil)
            (t (signal 'wrong-type-argument (list 'array key))))
      (define-key keymap key def))))

(defun lazy-unset-key (key-list &optional keymap)
  "This function is to little type when unset key binding.
`KEYMAP' is add keymap for some binding, default is `current-global-map'
`KEY-LIST' is list contain key."
  (let (key)
    (or keymap (setq keymap (current-global-map)))
    (dolist (key key-list)
      (cond ((stringp key) (setq key (read-kbd-macro (concat key))))
            ((vectorp key) nil)
            (t (signal 'wrong-type-argument (list 'array key))))
      (define-key keymap key nil))))

(provide 'lazy-set-key)

;;; lazy-set-key.el ends here

#+end_src

* File: inits/40-popwin.el
#+begin_src emacs-lisp :tangle inits/40-popwin.el
(use-package popwin
  :straight t
  :config
  (popwin-mode 1))

(provide '40-popwin)

#+end_src

* File: inits/40-recentf.el
#+begin_src emacs-lisp :tangle inits/40-recentf.el
(use-package recentf
  :config
  ;; This block only runs when recentf loads, so variables exist.
  (setq recentf-auto-cleanup 'never)
  (add-to-list 'recentf-exclude 'file-remote-p)
  (recentf-mode 1))

(provide '40-recentf)

#+end_src

* File: inits/40-tree-sitter.el
#+begin_src emacs-lisp :tangle inits/40-tree-sitter.el
(use-package tree-sitter
  :if (executable-find "tree-sitter")
  :config
  (global-tree-sitter-mode)
  :straight t
  :init
  (setq treesit-language-source-alist
        '((astro "https://github.com/virchau13/tree-sitter-astro")
          (bash "https://github.com/tree-sitter/tree-sitter-bash")
          (c "https://github.com/tree-sitter/tree-sitter-c")
          (cmake "https://github.com/uyha/tree-sitter-cmake")
          (common-lisp "https://github.com/theHamsta/tree-sitter-commonlisp")
          (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
          (css "https://github.com/tree-sitter/tree-sitter-css")
          (csharp "https://github.com/tree-sitter/tree-sitter-c-sharp")
          (elisp "https://github.com/Wilfred/tree-sitter-elisp")
          (go "https://github.com/tree-sitter/tree-sitter-go")
          (go-mod "https://github.com/camdencheek/tree-sitter-go-mod")
          (html "https://github.com/tree-sitter/tree-sitter-html")
          (js ("https://github.com/tree-sitter/tree-sitter-javascript" "master" "src"))
          (json "https://github.com/tree-sitter/tree-sitter-json")
          (lua "https://github.com/Azganoth/tree-sitter-lua")
          (make "https://github.com/alemuller/tree-sitter-make")
          (markdown "https://github.com/ikatyang/tree-sitter-markdown")
          (python "https://github.com/tree-sitter/tree-sitter-python")
          (r "https://github.com/r-lib/tree-sitter-r")
          (rust "https://github.com/tree-sitter/tree-sitter-rust")
          (toml "https://github.com/tree-sitter/tree-sitter-toml")
          (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
          (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
          (yaml "https://github.com/ikatyang/tree-sitter-yaml"))))

(use-package tree-sitter-langs
  :after tree-sitter
  :hook ((c-mode c++-mode java-mode rustic-mode python-mode json-mode yaml-mode go-mode terraform-mode toml-mode) . tree-sitter-hl-mode))

(use-package treesit-auto
  :custom
  (treesit-auto-install 'prompt)
  :config
  ;; yaml intentionally excluded due to indent limitations
  ;; see: https://www.reddit.com/r/emacs/comments/17gtxmr/indentation_in_yamltsmode/
  (treesit-auto-add-to-auto-mode-alist '(rust go toml python elisp csharp c cmake typescript r html js css cpp bash astro))
  (global-treesit-auto-mode))

(provide '60-tree-sitter)

#+end_src

* File: inits/50-perspective.el
#+begin_src emacs-lisp :tangle inits/50-perspective.el
;; TODO: Doesn't work with poetry-mode's switch-buffer poetry-tracking-mode strategy
;; (use-package perspective
;;   :straight t
;;   :after counsel
;;   :bind-keymap
;;   ("C-z" . perspective-map)
;;   :bind
;;   ("C-x b" . 'persp-counsel-switch-buffer)
;;   ("C-x C-M-b" . 'persp-bs-show)
;;   (:map perspective-map
;;         ("SPC" . persp-switch)
;;         ("k" . persp-kill)
;;         ("C-k" . persp-kill)
;;         ("M-k" . persp-kill)
;;         ("C-p" . persp-prev)
;;         ("C-n" . persp-next)
;;         ("a" . persp-switch-last)
;;         ("C-a" . persp-switch-last)
;;         ("c" . persp-switch)
;;         )
;;   :custom
;;   (persp-state-default-file "~/.emacs.d/data/persp-state-file")
;;   (persp-mode-prefix-key (kbd "C-c M-p"))
;;   :hook
;;   (kill-emacs . persp-state-save)
;;   :config
;;   (persp-mode)
;;   )

(provide '40-perspective)

#+end_src

* File: inits/60-ace-window.el
#+begin_src emacs-lisp :tangle inits/60-ace-window.el
(use-package ace-window
  :commands ace-window
  :straight t
  :init
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  :bind (("C-x o" . ace-window))

  ;; :config
  ;; (add-to-list 'aw-ignored-buffers " *example*")
  )

(provide '60-ace-window)

#+end_src

* File: inits/60-agent-shell.el
#+begin_src emacs-lisp :tangle inits/60-agent-shell.el
(use-package agent-shell
  :straight
  :ensure t
  :init
  ;; Load secrets.el (don't error if missing)
  (load (expand-file-name "secrets.el" user-emacs-directory) t)

  :config
  ;; Check for the variable YOU confirmed you have in secrets.el
  (if (and (boundp 'my-gemini-api-key)
           (stringp my-gemini-api-key)
           (not (string-empty-p my-gemini-api-key)))
      (progn
        ;; DEBUG: Print the last 4 chars of the key to the Messages buffer to prove which one is loaded
        (message "✅ Agent-Shell: Configuring with key ending in ...%s"
                 (substring my-gemini-api-key -4))

        ;; 1. Configure Authentication using your secret variable
        (setq agent-shell-google-authentication
              (agent-shell-google-make-authentication :api-key my-gemini-api-key))

        ;; 2. Configure Environment (passes key to the underlying CLI tool)
        (setq agent-shell-google-gemini-environment
              (agent-shell-make-environment-variables
               "GOOGLE_API_KEY" my-gemini-api-key
               ;; Explicitly DISABLE Vertex AI to force API Key usage
               "GOOGLE_GENAI_USE_VERTEXAI" nil
               :inherit-env t)))

    ;; Fallback: Warn if the variable is missing
    (warn "❌ Agent-Shell Error: 'my-gemini-api-key' is empty or missing in secrets.el!")))

#+end_src

* File: inits/60-apheleia.el
#+begin_src emacs-lisp :tangle inits/60-apheleia.el
(use-package apheleia
  :straight t
  :config
  (apheleia-global-mode +1)

  ;; Explicitly tell Apheleia to use Prettier for TS/JS
  ;; it respects .editorconfig
  (setf (alist-get 'typescript-mode apheleia-mode-alist) '(prettier))
  (setf (alist-get 'typescript-ts-mode apheleia-mode-alist) '(prettier))
  (setf (alist-get 'tsx-ts-mode apheleia-mode-alist) '(prettier))
  (setf (alist-get 'python-mode apheleia-mode-alist) '(ruff-isort ruff))
  (setf (alist-get 'python-ts-mode apheleia-mode-alist) '(ruff-isort ruff))
  )

(provide '60-apheleia)

#+end_src

* File: inits/60-avy.el
#+begin_src emacs-lisp :tangle inits/60-avy.el
(use-package avy
  :straight t
    ;; :bind
    ;; ("C-'" . 'avy-goto-char)
)

(provide '60-avy)

#+end_src

* File: inits/60-aws.el
#+begin_src emacs-lisp :tangle inits/60-aws.el
;; (use-package cfn-mode
;;   :config
;;   (add-to-list 'magic-mode-alist
;;     '("\\(.\\|\n\\)*Type: AWS::" . cfn-mode))
;;   ;; hack to stop this file from having cfn-mode enabled based on the
;;   ;; presence of the cfn-mode magic-mode-alist set up
;;   (add-to-list 'magic-mode-alist
;;     '("\\(.\\|\n\\)*;;; Commentary" . emacs-lisp-mode)))

;; (use-package flycheck-cfn
;;   :after (flycheck cfn-mode)
;;   :config
;;   (flycheck-cfn-setup))

(provide '60-aws)

#+end_src

* File: inits/60-breadcrumb.el
#+begin_src emacs-lisp :tangle inits/60-breadcrumb.el
;;; Header line context of symbol/heading (breadcrumb.el)
(use-package breadcrumb
  :straight t
  :hook (after-init . breadcrumb-mode)
  :config
  (setq breadcrumb-project-max-length 0.5)
  (setq breadcrumb-project-crumb-separator "/")
  (setq breadcrumb-imenu-max-length 1.0)
  (setq breadcrumb-imenu-crumb-separator " » ")

  ;; Only update breadcrumbs when idle for 0.5s, not instantly.
  ;; This prevents it from allocating strings during rapid undo/navigation.
  (setq breadcrumb-idle-delay 0.5)
  )


(provide '60-breadcrumb)

#+end_src

* File: inits/60-chrome-emacs.el
#+begin_src emacs-lisp :tangle inits/60-chrome-emacs.el
(use-package atomic-chrome
  :demand t
  :straight (atomic-chrome
             :repo "KarimAziev/atomic-chrome"
             :type git
             :host github)
  :commands (atomic-chrome-start-server)
  :config
  (setq atomic-chrome-default-major-mode 'markdown-mode)
  (setq atomic-chrome-buffer-open-style 'full)
  (setq-default atomic-chrome-extension-type-list '(atomic-chrome))
  (setq-default atomic-chrome-url-major-mode-alist
                '(("github.com" . gfm-mode)
                  ("gitlab.com" . gfm-mode)
                  ("leetcode.com" . python-mode)))
  ;; (add-hook 'atomic-chrome-edit-mode-hook 'my/atomic-chrome-hooks)

  (general-unbind 'atomic-chrome-edit-mode-map
    :with 'atomic-chrome-close-current-buffer
    ;; [remap my/kill-this-buffer]
    )

  ;; (general-unbind 'atomic-chrome-edit-mode-map
  ;;   :with 'ignore
  ;;   [remap my/quiet-save-buffer])

  ;; (defun my/atomic-chrome-hooks ()
  ;;   (interactive)
  ;;   (focus-emacs)
  ;;   (olivetti-mode +1))

  (atomic-chrome-start-server))

(provide '60-chrome-emacs)

#+end_src

* File: inits/60-competitive-programming.el
#+begin_src emacs-lisp :tangle inits/60-competitive-programming.el
(provide '60-competitive-programming)

#+end_src

