dotemacs.org
* File: inits/60-consult.el
#+begin_src emacs-lisp :tangle inits/60-consult.el
;; Example configuration for Consult
(use-package consult
  ;; Replace bindings. Lazily loaded due by `use-package'.
  :bind (;; C-c bindings in `mode-specific-map'
         ("C-c M-x" . consult-mode-command)
         ("C-c h" . consult-history)
         ("C-c k" . consult-kmacro)
         ("C-c m" . consult-man)
         ("C-c i" . consult-info)
         ([remap Info-search] . consult-info)
         ;; C-x bindings in `ctl-x-map'
         ("C-x M-:" . consult-complex-command)     ;; orig. repeat-complex-command
         ("C-x b" . consult-buffer)                ;; orig. switch-to-buffer
         ("C-x 4 b" . consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
         ("C-x 5 b" . consult-buffer-other-frame)  ;; orig. switch-to-buffer-other-frame
         ("C-x t b" . consult-buffer-other-tab)    ;; orig. switch-to-buffer-other-tab
         ("C-x r b" . consult-bookmark)            ;; orig. bookmark-jump
         ("C-x p b" . consult-project-buffer)      ;; orig. project-switch-to-buffer
         ;; Custom M-# bindings for fast register access
         ("M-#" . consult-register-load)
         ("M-'" . consult-register-store)          ;; orig. abbrev-prefix-mark (unrelated)
         ("C-M-#" . consult-register)
         ;; Other custom bindings
         ("M-y" . consult-yank-pop)                ;; orig. yank-pop
         ;; M-g bindings in `goto-map'
         ("M-g e" . consult-compile-error)
         ("M-g f" . consult-flymake)               ;; Alternative: consult-flycheck
         ("M-g g" . consult-goto-line)             ;; orig. goto-line
         ("M-g M-g" . consult-goto-line)           ;; orig. goto-line
         ("M-g o" . consult-outline)               ;; Alternative: consult-org-heading
         ("M-g m" . consult-mark)
         ("M-g k" . consult-global-mark)
         ("M-g i" . consult-imenu)
         ("M-g I" . consult-imenu-multi)
         ;; M-s bindings in `search-map'
         ("M-s d" . consult-find)                  ;; Alternative: consult-fd
         ("M-s c" . consult-locate)
         ("M-s g" . consult-grep)
         ("M-s G" . consult-git-grep)
         ("M-s r" . consult-ripgrep)
         ("M-s l" . consult-line)
         ("M-s L" . consult-line-multi)
         ("M-s k" . consult-keep-lines)
         ("M-s u" . consult-focus-lines)
         ;; Isearch integration
         ("M-s e" . consult-isearch-history)
         :map isearch-mode-map
         ("M-e" . consult-isearch-history)         ;; orig. isearch-edit-string
         ("M-s e" . consult-isearch-history)       ;; orig. isearch-edit-string
         ("M-s l" . consult-line)                  ;; needed by consult-line to detect isearch
         ("M-s L" . consult-line-multi)            ;; needed by consult-line to detect isearch
         ;; Minibuffer history
         :map minibuffer-local-map
         ("M-s" . consult-history)                 ;; orig. next-matching-history-element
         ("M-r" . consult-history))                ;; orig. previous-matching-history-element

  ;; Enable automatic preview at point in the *Completions* buffer. This is
  ;; relevant when you use the default completion UI.
  :hook (completion-list-mode . consult-preview-at-point-mode)

  ;; The :init configuration is always executed (Not lazy)
  :init

  ;; Optionally configure the register formatting. This improves the register
  ;; preview for `consult-register', `consult-register-load',
  ;; `consult-register-store' and the Emacs built-ins.
  (setq register-preview-delay 0.5
        register-preview-function #'consult-register-format)

  ;; Optionally tweak the register preview window.
  ;; This adds thin lines, sorting and hides the mode line of the window.
  (advice-add #'register-preview :override #'consult-register-window)

  ;; Use Consult to select xref locations with preview
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)

  ;; Configure other variables and modes in the :config section,
  ;; after lazily loading the package.
  :config

  ;; Optionally configure preview. The default value
  ;; is 'any, such that any key triggers the preview.
  ;; (setq consult-preview-key 'any)
  ;; (setq consult-preview-key "M-.")
  ;; (setq consult-preview-key '("S-<down>" "S-<up>"))
  ;; For some commands and buffer sources it is useful to configure the
  ;; :preview-key on a per-command basis using the `consult-customize' macro.
  (consult-customize
   consult-theme :preview-key '(:debounce 0.2 any)
   consult-ripgrep consult-git-grep consult-grep
   consult-bookmark consult-recent-file consult-xref
   consult--source-bookmark consult--source-file-register
   consult--source-recent-file consult--source-project-recent-file
   ;; :preview-key "M-."
   :preview-key '(:debounce 0.4 any))

  ;; Optionally configure the narrowing key.
  ;; Both < and C-+ work reasonably well.
  (setq consult-narrow-key "<") ;; "C-+"

  ;; Optionally make narrowing help available in the minibuffer.
  ;; You may want to use `embark-prefix-help-command' or which-key instead.
  ;; (define-key consult-narrow-map (vconcat consult-narrow-key "?") #'consult-narrow-help)

  ;; By default `consult-project-function' uses `project-root' from project.el.
  ;; Optionally configure a different project root function.
  ;;;; 1. project.el (the default)
  ;; (setq consult-project-function #'consult--default-project--function)
  ;;;; 2. vc.el (vc-root-dir)
  ;; (setq consult-project-function (lambda (_) (vc-root-dir)))
  ;;;; 3. locate-dominating-file
  ;; (setq consult-project-function (lambda (_) (locate-dominating-file "." ".git")))
  ;;;; 4. projectile.el (projectile-project-root)
  ;; (autoload 'projectile-project-root "projectile")
  ;; (setq consult-project-function (lambda (_) (projectile-project-root)))
  ;;;; 5. No project support
  ;; (setq consult-project-function nil)
  )

#+end_src

* File: inits/60-copilot.el
#+begin_src emacs-lisp :tangle inits/60-copilot.el
;; copilot
(use-package copilot
  :straight (:host github :repo "zerolfx/copilot.el" :files ("dist" "*.el"))
  :ensure t
  :bind (:map copilot-mode-map
              ;; TODO: figure out a better way where this doesn't conflict with company
              ;; ("<tab>" . my/copilot-tab)
              ("M-C-<" . copilot-previous-completion)
              ("M-C->" . copilot-next-completion)
              ("M-C-<tab>" . copilot-accept-completion-by-line))
  :config

  ;; (defun my/copilot-tab ()
  ;;   "Call copilot if you can, else company else yasnippet, else indent."
  ;;   (interactive)
  ;;   (or (copilot-accept-completion)
  ;;       (company-indent-or-complete-common nil)
  ;;       ;; (company-yasnippet-or-completion)
  ;;       (indent-for-tab-command nil))))

  ;; disabled for being buggy
  ;; (use-package copilot-chat
  ;;   :straight (:host github :repo "chep/copilot-chat.el" :files ("*.el"))
  ;;   :after (request shell-maker)
  ;;   :custom
  ;;   (copilot-chat-frontend 'shell-maker)
  ;;   :config
  ;;   (require 'copilot-chat-shell-maker)
  ;;   (push '(shell-maker . copilot-chat-shell-maker-init) copilot-chat-frontend-list)
  ;; (copilot-chat-shell-maker-init)
  )

(provide '60-copilot)

#+end_src

* File: inits/60-csv.el
#+begin_src emacs-lisp :tangle inits/60-csv.el
(use-package csv-mode
  :straight t
  ;; Always enter CSV mode in align mode; makes it easier to read.
  :hook
  (csv-mode . csv-align-mode)
  ;; :init
  ;; ;; show persistent header line
  ;; (csv-header-line)
)

(provide '60-csv)

#+end_src

* File: inits/60-devdocs.el
#+begin_src emacs-lisp :tangle inits/60-devdocs.el
(use-package devdocs
  :straight t
  :config
  (global-set-key (kbd "C-h D") 'devdocs-lookup))

(use-package devdocs-browser
  :straight t
  :after devdocs
  :defer t)


(provide '60-devdocs)

#+end_src

* File: inits/60-diff-hl.el
#+begin_src emacs-lisp :tangle inits/60-diff-hl.el
(use-package diff-hl
  :init
  (add-hook 'magit-pre-refresh-hook 'diff-hl-magit-pre-refresh)
  (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)
  :config
  (global-diff-hl-mode))

(provide '60-diff)

#+end_src

* File: inits/60-dired.el
#+begin_src emacs-lisp :tangle inits/60-dired.el
(use-package dired
  :straight (:type built-in)
  :init
  (load "dired-x")
  :config
  ;; Don't create new buffer with RET key
  ;; http://www.pshared.net/diary/20071207.html#p02
  (put 'dired-find-alternate-file 'disabled nil)
  (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file)
  (define-key dired-mode-map "a" 'dired-advertised-find-file)

  ;; macOS `ls' does not have `--dired' , so use coreutils `ls'
  (if (file-executable-p "/usr/local/bin/gls")
      (setq insert-directory-program "/usr/local/bin/gls"))

  ;; recursive copy and recursive delete
  (setq dired-recursive-copies 'always)
  (setq dired-recursive-deletes 'always)

  ;; Case insentitive search by default
  (setq find-grep-options "-q -i")

  ;; Recursive, interractive find and replace with dired:
  ;;   M-x find-name-dired: you will be prompted for a root directory and a filename pattern.
  ;;   Press t to "toggle mark" for all files found.
  ;;   Press Q for "Query-Replace in Files...": you will be prompted for query/substitution regexps.
  ;;   Proceed as with query-replace-regexp: SPACE to replace and move to next match, n to skip a match, etc.
  ;;   Press C-x s to save buffers. (You can then press y for yes, n for no, or ! for yes for all)


  ;; use dired-x instead of dired
  ;; (add-hook 'dired-load-hook
  ;;              (function (lambda ()
  ;;                                      (load "dired-x")
  ;;                                      ;; set global variables here.
  ;;                                      ;; ex)
  ;;                                      ;; (setq dired-guess-shell-gnutar "gtar")
  ;;                                      )))
  ;; (add-hook 'dired-mode-hook
  ;;              (function (lambda ()
  ;;                                      ;; set buffer-local variables here.
  ;;                                      ;; ex)
  ;;                                      ;; (dired-omit-mode 1)
  ;;                                      )))

  (use-package nerd-icons-dired
    :straight t
    :if (display-graphic-p)
    :hook (dired-mode . nerd-icons-dired-mode))
  )

#+end_src

* File: inits/60-docker.el
#+begin_src emacs-lisp :tangle inits/60-docker.el
;;; Docker

(use-package dockerfile-mode
  :straight t
  :defer t
  :mode (("Dockerfile\\'" . dockerfile-mode)
         ("Dockerfile.dev'" . dockerfile-mode))
  )

(provide '60-docker)

#+end_src

* File: inits/60-emacs-ipython-notebook.el
#+begin_src emacs-lisp :tangle inits/60-emacs-ipython-notebook.el
(use-package ein
  :straight t
  :defer t
  :commands ein:notebooklist-open
  )

(provide '60-emacs-ipython-notebook)

#+end_src

* File: inits/60-expand-region.el
#+begin_src emacs-lisp :tangle inits/60-expand-region.el
(use-package expand-region
  :straight t
  :bind ("C-=" . er/expand-region))

(provide '60-expand-region)

#+end_src

* File: inits/60-flycheck.el
#+begin_src emacs-lisp :tangle inits/60-flycheck.el
(use-package flycheck
  :straight t
  :commands (global-flycheck-mode)
  :bind
  ("C-c C-c l" . flycheck-list-errors)
  :hook
  (after-init . global-flycheck-mode)
  :init
  (push '("*Flycheck errors*") popwin:special-display-config)
  :config
  ;; https://www.emacswiki.org/emacs/CfnLint
  (flycheck-define-checker cfn-lint
    "AWS CloudFormation linter using cfn-lint.

Install cfn-lint first: pip install cfn-lint

See `https://github.com/aws-cloudformation/cfn-python-lint'."
    :command ("cfn-lint" "-f" "parseable" source)
    :error-patterns ((warning line-start (file-name) ":" line ":" column
                              ":" (one-or-more digit) ":" (one-or-more digit) ":"
                              (id "W" (one-or-more digit)) ":" (message) line-end)
                     (error line-start (file-name) ":" line ":" column
                            ":" (one-or-more digit) ":" (one-or-more digit) ":"
                            (id "E" (one-or-more digit)) ":" (message) line-end))
    :modes (cfn-json-mode cfn-yaml-mode))
  (add-to-list 'flycheck-checkers 'cfn-lint)
  )

(provide '60-flycheck)

#+end_src

