dotemacs.org
* File: inits/60-fold.el
#+begin_src emacs-lisp :tangle inits/60-fold.el
;; Code Folding
(use-package treesit-fold-indicators
  :straight (treesit-fold-indicators :type git :host github :repo "emacs-tree-sitter/treesit-fold"))

(use-package treesit-fold
  :straight (treesit-fold :type git :host github :repo "emacs-tree-sitter/treesit-fold")
  :config
  ;; TODO: Figure out why this causes company to be insanely slow
  ;; (add-hook 'tree-sitter-after-on-hook #'treesit-fold-indicators-mode)
  (my/defkeymap
   "my-treesit-fold" "C-c f"
   '("O" . treesit-fold-open-all)
   '("o" . treesit-fold-open-recursively)
   '("C" . treesit-fold-close-all)
   '("c" . treesit-fold-close)
   '("z" . treesit-fold-toggle)
   '("i" . treesit-fold-indicators-mode)))



(provide '60-fold)

#+end_src

* File: inits/60-git.el
#+begin_src emacs-lisp :tangle inits/60-git.el
(use-package magit
  :straight t
  :bind
  (("C-x g" . magit-status))
  :config
  (setq magit-diff-visit-file-action 'magit-diff-goto-file)
  )

(use-package magit-find-file
  :straight t
  )

(use-package magit-todos
  :after magit
  :straight t
  :config
  (magit-todos-mode)
  ;; fix rg scan limitation on windows
  ;; see: https://github.com/alphapapa/magit-todos/issues/156#issuecomment-1908717384
  (if (eq system-type 'windows-nt)
      (progn
        ;; The configuration for Windows. This is where we use git-grep.
        (setq magit-todos-scanner 'magit-todos--scan-with-git-grep)
        (setq magit-todos-git-grep-extra-args '("-n"))
        (setq magit-todos-nice nil))
    ;; The rest of your original configuration for other OSes goes here.
    (progn
      (setq magit-todos-scanners nil)
      (magit-todos-defscanner "rg"
                              ;; :test (executable-find "rg")
                              :directory-form (f-relative directory default-directory) ;; revert
                              :allow-exit-codes (0 1)
                              :command (list "rg" "--no-heading" "--line-number"
                                             (when depth
                                               (list "--maxdepth" (1+ depth)))
                                             (when magit-todos-ignore-case
                                               "--ignore-case")
                                             (when magit-todos-exclude-globs
                                               (--map (list "--glob" (concat "!" it))
                                                      magit-todos-exclude-globs))
                                             (unless magit-todos-submodule-list
                                               (--map (list "--glob" (concat "!" it))
                                                      (magit-list-module-paths)))
                                             extra-args search-regexp-pcre directory)))))


;; Migrated to diff-hl
;; see: https://github.com/dgutov/diff-hl

;; (use-package git-gutter
;;   :hook (prog-mode . git-gutter-mode)
;;   :config
;;   (setq git-gutter:update-interval 0.02))

;; (use-package git-gutter-fringe
;;   :config
;;   (define-fringe-bitmap 'git-gutter-fr:added [224] nil nil '(center repeated))
;;   (define-fringe-bitmap 'git-gutter-fr:modified [224] nil nil '(center repeated))
;;   (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240] nil nil 'bottom))

;; (use-package git-gutter+
;;   :straight t
;;   :bind
;;   ((:map git-gutter+-mode-map
;;          ;; Jump between hunks
;;          ("C-x n" . git-gutter+-next-hunk)
;;          ("C-x p" . git-gutter+-previous-hunk)
;;          ;; Act on hunks
;;          ("C-x v =" . git-gutter+-show-hunk)
;;          ("C-x r" . git-gutter+-revert-hunks)
;;          ;; Stage hunk at point.
;;          ;; If region is active, stage all hunk lines within the region.
;;          ("C-x t" . git-gutter+-stage-hunks)
;;          ("C-x c" . git-gutter+-commit)
;;          ("C-x C" . git-gutter+-stage-and-commit)
;;          ("C-x C-y" . git-gutter+-stage-and-commit-whole-buffer)
;;          ("C-x U" . git-gutter+-unstage-whole-buffer)
;;          ))
;;   :init
;;   (add-hook 'prog-mode-hook 'git-gutter+-mode)
;;   (add-hook 'yaml-mode-hook 'git-gutter+-mode)
;;   (add-hook 'emacs-lisp-mode-hook 'git-gutter+-mode)
;;   (add-hook 'go-mode-hook 'git-gutter+-mode)
;;   (add-hook 'rust-mode-hook 'git-gutter+-mode)
;;   (add-hook 'python-mode-hook 'git-gutter+-mode)
;;   (add-hook 'c++-mode-hook 'git-gutter+-mode)
;;   (add-hook 'java-mode-hook 'git-gutter+-mode)
;;   :config
;;   )

;; (use-package git-link
;;   :straight t
;;   :bind
;;   ("C-c g l" . git-link)
;;   :init
;;   :config
;;   (if (file-exists-p "~/.emacs.d/secret/git-link-ghe.el")
;;       (load "~/.emacs.d/secret/git-link-ghe.el"))
;;   (setq git-link-use-commit t)
;;   )

(provide '60-git)

#+end_src

* File: inits/60-gitlab-ci.el
#+begin_src emacs-lisp :tangle inits/60-gitlab-ci.el
(use-package gitlab-ci-mode
  :straight t
  :mode "\\.gitlab-ci.yml\\'")

(use-package gitlab-ci-mode-flycheck
  :straight t
  :after flycheck gitlab-ci-mode
  :init
  (gitlab-ci-mode-flycheck-enable))

(provide '60-gitlab-ci)

#+end_src

* File: inits/60-go.el
#+begin_src emacs-lisp :tangle inits/60-go.el
(defun my-go-before-save ()
  (interactive)
  (when lsp-mode
    (lsp-organize-imports)
    (lsp-format-buffer)))

(use-package go-mode
  :defer t
  :straight t
  :mode "\\.go\\'"
  :config
  (add-hook 'go-mode-hook 'lsp-deferred)
  (add-hook 'go-mode-hook
            (lambda ()
              (add-hook 'before-save-hook 'my-go-before-save))))

(provide '60-go)

#+end_src

* File: inits/60-gpt.el
#+begin_src emacs-lisp :tangle inits/60-gpt.el
(defun my/gptel-api-key (host)
  (let ((secret (auth-source-pick-first-password
                 :host host)))
    secret))
;; in-emacs gpt prompt
(use-package gptel
  :straight (gpt :type git :host github :repo "karthink/gptel")
  :bind
  ("C-c C-a" . 'gptel)


  :custom
  ;; default curl on windows doesn't work with gptel
  ;; see: https://github.com/karthink/gptel/issues/90
  ;; TODO: get working with msys2 curl on windows
  (gptel-use-curl nil)
  :config
  ;; Setup claude
  (setq
   gptel-model "claude-3-sonnet-20240229" ;  "claude-3-opus-20240229" also available
   gptel-backend (gptel-make-anthropic "Claude"
                   :stream t :key (my/gptel-api-key "api.claude.com")))
  ;; (setq
  ;;  gptel-model "gemini-pro"
  ;;  gptel-backend (gptel-make-gemini "Gemini"
  ;;                  :stream t :key (my/gptel-api-key "generativelanguage.googleapis.com")))
  )

;; allows code generation from gpt
(use-package codegpt
  :straight (codegpt :type git :host github :repo "emacs-openai/codegpt"))

;; TODO: add support for gemini?

(provide '60-gpt)

#+end_src

* File: inits/60-helm.el
#+begin_src emacs-lisp :tangle inits/60-helm.el
;; helm was actually cool and better than ivy maybe I should update it
;; (require 'init-helm)
;;                                         ;open new buffer for all helm commands
;;                                         ;(setq helm-display-function 'helm-custom-display-buffer)
;;                                         ;(setq helm-show-completion-display-function #'helm-custom-display-buffer)
;; (setq helm-display-function 'helm-display-buffer-in-own-frame
;;       helm-display-buffer-reuse-frame nil
;;       helm-use-undecorated-frame-option t)
;; (setq helm-show-completion-display-function 'helm-display-buffer-in-own-frame
;;       helm-display-buffer-reuse-frame nil
;;       helm-use-undecorated-frame-optionrated-frame-option t)

;;(provide '60-helm)

#+end_src

