inits/60-helm.el
;; helm was actually cool and better than ivy maybe I should update it
;; (require 'init-helm)
;;                                         ;open new buffer for all helm commands
;;                                         ;(setq helm-display-function 'helm-custom-display-buffer)
;;                                         ;(setq helm-show-completion-display-function #'helm-custom-display-buffer)
;; (setq helm-display-function 'helm-display-buffer-in-own-frame
;;       helm-display-buffer-reuse-frame nil
;;       helm-use-undecorated-frame-option t)
;; (setq helm-show-completion-display-function 'helm-display-buffer-in-own-frame
;;       helm-display-buffer-reuse-frame nil
;;       helm-use-undecorated-frame-optionrated-frame-option t)

;;(provide '60-helm)
