dotemacs.org
* File: inits/60-highlight-indentation.el
#+begin_src emacs-lisp :tangle inits/60-highlight-indentation.el
;; see: https://github.com/protesilaos/modus-themes/issues/98
(defun my/set-highlight-indent-guides-faces-default ()
  "Set theme-agnostic `highlight-indent-guides' faces.

Not pretty or dynamic, but they should be serviceable."
  (when (not highlight-indent-guides-auto-enabled)
    (set-face-background 'highlight-indent-guides-odd-face "darkgray")
    (set-face-background 'highlight-indent-guides-even-face "dimgray")
    (set-face-foreground 'highlight-indent-guides-character-face "dimgray")
    (set-face-background 'highlight-indent-guides-top-odd-face "darkgray")
    (set-face-background 'highlight-indent-guides-top-even-face "dimgray")
    (set-face-foreground 'highlight-indent-guides-top-character-face "dimgray")
    (set-face-background 'highlight-indent-guides-stack-odd-face "darkgray")
    (set-face-background 'highlight-indent-guides-stack-even-face "dimgray")
    (set-face-foreground 'highlight-indent-guides-stack-character-face "dimgray")))

(defun my/set-highlight-indent-guides-faces-for-modus ()
  "Customize `highlight-indent-guides' faces for Modus themes.

These faces rely on Modus themes' custom color variables."
  (modus-themes-with-colors
    ;; Customize faces for `highlight-indent-guides-mode' when using
    ;; `modus-themes' since `highlight-indent-guides-mode' cannot seem to
    ;; figure out its faces on its own.
    (when (not highlight-indent-guides-auto-enabled)
      (set-face-background 'highlight-indent-guides-odd-face bg-dim)
      (set-face-background 'highlight-indent-guides-even-face bg-dim)
      (set-face-foreground 'highlight-indent-guides-character-face bg-dim)
      (set-face-background 'highlight-indent-guides-top-odd-face magenta-faint)
      (set-face-background 'highlight-indent-guides-top-even-face magenta-faint)
      (set-face-foreground 'highlight-indent-guides-top-character-face magenta-faint)
      (set-face-background 'highlight-indent-guides-stack-odd-face bg-lavender)
      (set-face-background 'highlight-indent-guides-stack-even-face bg-lavender)
      (set-face-foreground 'highlight-indent-guides-stack-character-face bg-lavender))))

(use-package highlight-indent-guides
  :straight t
  :hook
  (prog-mode . highlight-indent-guides-mode) ;; automatically start mode
  (yaml-mode . highlight-indent-guides-mode)
  (yaml-ts-mode . highlight-indent-guides-mode)
  (cfn-mode . highlight-indent-guides-mode)
  (json-mode . highlight-indent-guides-mode)
  (json-ts-mode . highlight-indent-guides-mode)
  :custom
  ;; Only highlight the first character of each indent level instead of the
  ;; entire column. This works better with minimap-mode.
  (highlight-indent-guides-method 'bitmap)
  ;; Whether to calculuate the faces for the indent guides automatically based
  ;; on the current theme. I have found that this method does not work well with
  ;; the Modus themes, so be warned. You may need to set the faces manually.
  (highlight-indent-guides-auto-enabled nil)
  ;; How to visualize your current position in the guide stack.
  ;; Must be one of:
  ;;   nil (default) - Disable responsive guides.
  ;;   top - Use a different color to highlight the "current" guide
  ;;         (the indentation block of the line that the cursor is on).
  ;;   stack - Like `top', but also use a third color for all "ancestor"
  ;;           guides of the current guide.
  (highlight-indent-guides-responsive 'top)
  :init
  (add-hook 'highlight-indent-guides-mode-hook
            (lambda ()
              (if (seq-some (lambda (th) (string-match "^modus-" (symbol-name th)))
                            custom-enabled-themes)
                  (my/set-highlight-indent-guides-faces-for-modus)
                (my/set-highlight-indent-guides-faces-default)))))


(provide '60-highlight-indentation)

#+end_src

* File: inits/60-kotlin.el
#+begin_src emacs-lisp :tangle inits/60-kotlin.el
(use-package kotlin-mode
  :straight t
  :mode ("\\.kts\\'" . kotlin-mode))

(provide '60-kotlin)

#+end_src

* File: inits/60-markdown-mode.el
#+begin_src emacs-lisp :tangle inits/60-markdown-mode.el
;; for git markdown
(use-package markdown-mode
  :straight t
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "multimarkdown"))

(provide '60-markdown-mode)

#+end_src

* File: inits/60-mermaid.el
#+begin_src emacs-lisp :tangle inits/60-mermaid.el
(use-package mermaid-mode)

#+end_src

* File: inits/60-multiple-cursors.el
#+begin_src emacs-lisp :tangle inits/60-multiple-cursors.el
(use-package multiple-cursors
  :straight t
  :bind (("C-S-c C-S-c" . mc/edit-lines)
         ("C->" . mc/mark-next-like-this)
         ("C-<" . mc/mark-previous-like-this)
         ("C-c C-<" . mc/mark-all-like-this))
  )

(provide '60-multiple-cursors)

#+end_src

* File: inits/60-neotree.el
#+begin_src emacs-lisp :tangle inits/60-neotree.el
(use-package neotree
  :straight t
  :bind
  ("<f5>" . 'neotree-toggle)
  :init
  ;; slow rendering
  (setq inhibit-compacting-font-caches t)
  ;; set icons theme
  (setq neo-theme (if (display-graphic-p) 'icons 'arrow))
  ;; Every time when the neotree window is opened, let it find current file and jump to node
  (setq neo-smart-open t)
  ;; When running ‘projectile-switch-project’ (C-c p p), ‘neotree’ will change root automatically
  (setq projectile-switch-project-action 'neotree-projectile-action)
  ;; show hidden files
  (setq-default neo-show-hidden-files t))

(provide '60-neotree)

#+end_src

* File: inits/60-nix.el
#+begin_src emacs-lisp :tangle inits/60-nix.el
;; NIX

(use-package nix-mode
  :straight t
  :mode "\\.nix\\'")

#+end_src

* File: inits/60-notebooking.el
#+begin_src emacs-lisp :tangle inits/60-notebooking.el
;; Use pandoc to convert files
(use-package pandoc-mode
  :defer 10
  :straight t
  :bind (:map pandoc-mode-map (("C-c /" . nil)))
  :hook (text-mode . pandoc-mode))

(use-package ox-ipynb
  :straight (:host github :repo "jkitchin/ox-ipynb"))

#+end_src

* File: inits/60-nov.el
#+begin_src emacs-lisp :tangle inits/60-nov.el
;; Read epubs in emacs
(use-package nov
  :straight t
  :preface
  (defun my/nov-delayed-render-setup ()
    (run-with-idle-timer 0.2 nil 'nov-render-document))
  (defun my/nov-fringes-setup ()
    "Hide the fringes for `nov-mode'."
    (set-window-fringes (get-buffer-window) 0 0 nil))
  :mode
  ("\\.epub$" . nov-mode)
  :hook
  (nov-mode . my/nov-delayed-render-setup)
  (nov-mode . my/nov-fringes-setup))

(provide '60-nov)

#+end_src

