dotemacs.org
* File: inits/60-origami.el
#+begin_src emacs-lisp :tangle inits/60-origami.el
;; Code folding
(use-package origami
  :straight t
  :config
  (global-origami-mode))

(provide '60-origami)

#+end_src

* File: inits/60-proto.el
#+begin_src emacs-lisp :tangle inits/60-proto.el
;; PROTOBUF

(defconst my-protobuf-style
  '((c-basic-offset . 2)
    (indent-tabs-mode . nil)))
(use-package protobuf-mode
  :straight t
  :init
  :mode
  ("\\.proto$" . protobuf-mode)
  :config
  (add-hook 'protobuf-mode-hook
            (lambda () (c-add-style "my-style" my-protobuf-style t)))
  )

(provide '60-proto)

#+end_src

* File: inits/60-python.el
#+begin_src emacs-lisp :tangle inits/60-python.el
(use-package python
  :straight t
  :init
  (setq indent-tabs-mode nil)
  (setq tab-width 4)
  (setq-default python-indent-guess-indent-offset nil)
  (setq python-indent-offset 4)
  (setq highlight-indentation-offset 4)
  (setq fill-column 100)
  (fci-mode)
  ;; TODO: explore eglot as an alternative
  ;; :hook ((python-mode . eglot-ensure))
  :bind (:map python-mode-map
              ;; Force the execution of the main block
              ("C-c C-b" .  (lambda () (interactive) (python-shell-send-buffer t)))))

(use-package poetry
  :defer t
  :straight (:build t)
  :commands (poetry-venv-toggle
             poetry-tracking-mode)
  :config
  (setq poetry-tracking-strategy 'project)
  (add-hook 'python-mode-hook #'poetry-tracking-mode))

(use-package python-pytest)

;; (use-package python-isort
;;   :hook
;;   (python-mode . python-isort-on-save-mode)
;;   (python-ts-mode . python-isort-on-save-mode)
;;   )

;; (use-package python-black
;;   ;; :hook
;;   ;; (python-mode . python-black-on-save-mode)
;;   ;; (python-ts-mode . python-black-on-save-mode)
;;   )

(use-package ruff-format
  :hook
  (python-mode . ruff-format-on-save-mode)
  (python-ts-mode . ruff-format-on-save-mode)
  )

;; Virtual Environment Management
(use-package pet
  :ensure t
  :ensure-system-package (sqlite3 dasel)
  :commands (pet-mode)
  :init (add-hook 'python-base-mode-hook 'pet-mode -10)
  :config
  ;; Pyright requires specific config to find our virtual environment
  ;; see: https://robbmann.io/posts/emacs-eglot-pyrightconfig/
  (defun my/pyrightconfig-write (virtualenv)
    (interactive "DEnv: ")

    (let* (;; file-truename and tramp-file-local-name ensure that neither `~' nor
           ;; the Tramp prefix (e.g. "/ssh:my-host:") wind up in the final
           ;; absolute directory path.
           (venv-dir (tramp-file-local-name (file-truename virtualenv)))

           ;; Given something like /path/to/.venv/, this strips off the trailing `/'.
           (venv-file-name (directory-file-name venv-dir))

           ;; Naming convention for venvPath matches the field for
           ;; pyrightconfig.json.  `file-name-directory' gets us the parent path
           ;; (one above .venv).
           (venvPath (file-name-directory venv-file-name))

           ;; Grabs just the `.venv' off the end of the venv-file-name.
           (venv (file-name-base venv-file-name))

           ;; Eglot demands that `pyrightconfig.json' is in the project root
           ;; folder.
           (base-dir (vc-git-root default-directory))
           (out-file (expand-file-name "pyrightconfig.json" base-dir))

           ;; Finally, get a string with the JSON payload.
           (out-contents (json-encode (list :venvPath venvPath :venv venv))))

      ;; Emacs uses buffers for everything.  This creates a temp buffer, inserts
      ;; the JSON payload, then flushes that content to final `pyrightconfig.json'
      ;; location
      (with-temp-file out-file (insert out-contents))))

  )


;; flymake-ruff integration
(use-package flymake-ruff
  :straight (flymake-ruff
             :type git
             :host github
             :repo "erickgnavar/flymake-ruff"))

(provide '60-python)

#+end_src

* File: inits/60-rainbow-delimiters.el
#+begin_src emacs-lisp :tangle inits/60-rainbow-delimiters.el
(use-package rainbow-delimiters
  :straight t
  :hook
  (prog-mode . rainbow-delimiters-mode))

(provide '60-rainbow-delimiters)

#+end_src

* File: inits/60-read-aloud.el
#+begin_src emacs-lisp :tangle inits/60-read-aloud.el
(use-package read-aloud
  :straight t
  :custom
  (read-aloud-engines '("flite" (cmd "flite" args ("--setf" "duration_stretch=.9"))))
  (read-aloud-engine "flite")
  :bind
  ("C-c C-v" . read-aloud-this)
  )

(provide '60-read-aloud)

#+end_src

* File: inits/60-rest.el
#+begin_src emacs-lisp :tangle inits/60-rest.el
(use-package restclient
  :mode ("\\.http\\'" . restclient-mode))

(use-package company-restclient
  :defer t)

(use-package ob-restclient
  :defer t)


(provide '60-rest)

#+end_src

* File: inits/60-ripgrep.el
#+begin_src emacs-lisp :tangle inits/60-ripgrep.el
(use-package ripgrep
  :if (executable-find "rg")
  :bind (("C-M-g" . ripgrep-regexp))
  :straight t
  :defer t
  :config
  (setq ripgrep-arguments '("--hidden" "--smart-case")))

(provide '60-ripgrep)

#+end_src

* File: inits/60-rust.el
#+begin_src emacs-lisp :tangle inits/60-rust.el
;; RUST
(defun my/rustic-before-save-fn ()
  "Format buffer and organize imports when saving anything using eglot."
  (eglot-format-buffer))

(use-package rustic
  :straight t
  ;; :after (flycheck eglot)
  :mode
  ("\\.rs\\'" . rustic-mode)
  ;; :preface
  ;; (defun my/rustic-mode-hook-fn ()
  ;;   "Needed for lsp-format-buffer to indent with 4 spaces"
  ;;   (setq tab-width 4
  ;;      indent-tabs-mode nil))
  ;; (defun my/switch-to-cargo-window ()
  ;;   "Switch to the *cargo* window."
  ;;   (other-window 1))
  :init
  ;; to use rustic-mode even if rust-mode also installed
  (setq rust-mode-treesitter-derive t)
  (setq auto-mode-alist (delete '("\\.rs\\'" . rust-mode) auto-mode-alist)
        rustic-lsp-server 'rust-analyzer)
  ;; ensure treesit-auto does not force rust-ts-mode; remap it back to rustic when available
  (when (boundp 'major-mode-remap-alist)
    (add-to-list 'major-mode-remap-alist '(rust-ts-mode . rustic-mode)))
  :hook
  ;; (rustic-mode . hs-minor-mode) ;; fold mode
  (rustic-mode . eldoc-mode) ;; code tracing
  (rustic-mode . company-mode) ;; autocomplete
  ;; (rustic-mode . cargo-minor-mode)
  (rustic-mode . flycheck-mode)
  ;; (flycheck-mode . flycheck-rust-setup)
  (rustic-mode . (lambda () (setq indent-tabs-mode nil))) ;; set indent
  ;; (rustic-mode . my/rustic-mode-hook-fn)
  (rustic-before-save . my/before-save-fn) ;; use lsp format

  :custom
  (rustic-lsp-server 'rust-analyzer)
  (rustic-lsp-client 'eglot)
  (rustic-format-on-save nil)    ;; slow on windows
  (lsp-rust-rls-server-command 'rust-analyzer)
  :config
  (push 'rustic-clippy flycheck-checkers)
  ;; prevents lsp-mode prompt
  (add-hook 'eglot--managed-mode-hook (lambda () (flymake-mode -1)))
  ;; (advice-add 'rustic-cargo-check :after #'my/switch-to-cargo-window)
  ;; (advice-add 'rustic-cargo-run :after #'my/switch-to-cargo-window)
  ;; (advice-add 'rustic-cargo-build :after #'my/switch-to-cargo-window)
  (add-hook 'before-save-hook (lambda () (when (eq 'rustic-mode major-mode)
                                           (my/rustic-before-save-fn))))
  ;; (add-hook 'lsp-after-open-hook (lambda ()
  ;;                                  (when (lsp-find-workspace 'rust-analyzer nil)
  ;;                                    (lsp-rust-analyzer-inlay-hints-mode))))
  ;; :bind (:map rustic-mode-map
  ;;             ("C-c C-c s" . lsp-rust-analyzer-status))
  )


(provide '60-rust)

#+end_src

* File: inits/60-saveplace.el
#+begin_src emacs-lisp :tangle inits/60-saveplace.el
(use-package saveplace
  :straight t
  :init (setq save-place-limit 100)
  :config (save-place-mode))

(provide '60-saveplace)

#+end_src

