dotemacs.org
* File: inits/60-shell.el
#+begin_src emacs-lisp :tangle inits/60-shell.el
;; bash
;; format bash
(use-package shfmt
  :straight (shfmt :host github
                   :repo "amake/shfmt.el"
                   :local-repo "amake/shfmt.el"
                   :branch "master"
                   )
  :hook (sh-mode . shfmt-on-save-mode)
  )
(use-package flycheck-shfmt
  :straight (flycheck-shfmt :host github
                            :repo "amake/shfmt.el"
                            :local-repo "amake/shfmt.el"
                            :files ("flycheck-shfmt.el")
                            :branch "master"
                            )
  :config
  (flycheck-shfmt-setup)
  )


;;; WINDOWS
(use-package fakecygpty
  ;; when using POSIX shells  on NT emacs we need to spawn these processes with fakecygpty.exe to ensure proper signal handling
  :straight (fakecygpty :host github
                        :repo "vleonbonnet/fakecygpty"
                        :branch "master")
  :if (eq system-type 'windows-nt)
  :init
  (fakecygpty-activate))

(when-on-windows
 (let* ((combine-path (lambda (dir dir-or-file)
                        (concat (file-name-as-directory dir) dir-or-file)))
        (base-dir "C:/msys64")
        (mingw64-bin-dir (funcall combine-path base-dir "ucrt64/bin"))
        (msys2-bin-dir (funcall combine-path base-dir "usr/bin"))
        (bash-path (funcall combine-path msys2-bin-dir "f_zsh.exe")))

   ;; Prepend the directories to exec-path
   (setq exec-path (append (list mingw64-bin-dir msys2-bin-dir) exec-path))

   (setq explicit-shell-file-name bash-path)
   (setenv "SHELL" bash-path)
   ;; Hint for MSYS2 bash to stay in the invoking directory.
   (setenv "CHERE_INVOKING" "1")
   ;; Avoid overriding the initial working directory by removing STARTDIR.
   (setenv "STARTDIR" nil)
   (setq explicit-bash.exe-args (list "--noediting" "--login" "-i"))
   (setenv "PATH" (concat mingw64-bin-dir path-separator
                          (concat msys2-bin-dir path-separator
                                  (getenv "PATH"))))))



;; probably better to use powershell on windows
(use-package powershell
  ;; https://learn.microsoft.com/en-us/archive/blogs/dotnetinterop/run-powershell-as-a-shell-within-emacs
  :if (eq system-type 'windows-nt)
  ;; :straight t
  ;; :bind (("C-c RET" . open-powershell-with-project-buffer-name))
  ;; :config
  ;; (defun open-powershell-with-project-buffer-name ()
  ;;   (interactive)
  ;;   (setq shell-buffer-name (my-get-shell-buffer-name))
  ;;   (powershell shell-buffer-name nil))
  ;; Change default compile command for powershell
  ;; (add-hook 'powershell-mode-hook
  ;;           (lambda ()
  ;;             (set (make-local-variable 'compile-command)
  ;;                  (format "powershell.exe -NoLogo -NonInteractive -Command \"& '%s'\""             ((my-get-project-or-filename) )))))
  )

(provide '60-shell)

#+end_src

* File: inits/60-shim.el
#+begin_src emacs-lisp :tangle inits/60-shim.el
;; shim applies pyenv, jenv, goenv, nodenv, etc
(use-package shim
  :straight (:host github :repo "twlz0ne/shim.el")
  :demand t
  :hook
  ((java-mode
    kotlin-mode
    ;; TODO: get this working with poetry-mode
    ;; python-mode
    go-mode
    ;; TODO: figure out crashing issue on typescript mode
    ;; typescript-mode
    ) . shim-mode)
  :config
  ;; (shim-init-ruby)
  ;; (shim-init-python)
  (shim-init-node)
  (shim-init-java)
  (shim-init-go)
  (shim-register-mode 'java 'kotlin-mode)
  (shim-register-mode 'node 'js2-mode))


(provide '60-shim)

#+end_src

* File: inits/60-smartparens.el
#+begin_src emacs-lisp :tangle inits/60-smartparens.el
;; paredit like behavior in non-lispy languages
;; TODO: mayebe use instead of paredit in lispy langs?
(use-package smartparens
  :diminish smartparens-mode ;; Do not show in modeline
  :straight t
  :init
  (require 'smartparens-config)
  :config
  ;; Increase the delay so it doesn't run while spamming undo
  (setq sp-show-pair-delay 0.2)
  (smartparens-global-strict-mode t)
  (show-smartparens-global-mode t)
  (setq sp-show-pair-from-inside t)
  :hook
  ((prog-mode . smartparens-strict-mode)
   (markdown-mode . smartparens-strict-mode))

  :custom-face
  (sp-show-pair-match-face ((t (:foreground "White")))) ;; Could also have :background "Grey"
  )

(provide '60-smartparens)

#+end_src

* File: inits/60-sql.el
#+begin_src emacs-lisp :tangle inits/60-sql.el
(use-package sql-indent
  :straight t
  :hook (sql-mode . sqlind-minor-mode))

(use-package sqlformat
  :straight t
  ;; TODO: get working on mac/windows
  ;; :ensure-system-package (pg_format . "sudo apt install pgformatter")
  :custom
  (sqlformat-command 'pgformatter)
  (sqlformat-args '("-s2" "-g"))
  :hook (sql-mode . sqlformat-on-save-mode)
  :bind (:map sql-mode-map ("C-c C-f" . sqlformat)))

(use-package flymake-sqlfluff
  :straight (flymake-sqlfluff
             :type git
             :host github
             :repo "erickgnavar/flymake-sqlfluff"))


(provide '60-sql)

#+end_src

* File: inits/60-toml.el
#+begin_src emacs-lisp :tangle inits/60-toml.el
(use-package toml-mode
  :straight t)

(provide '60-toml)

#+end_src

