dotemacs.org
* File: inits/60-vdiff.el
#+begin_src emacs-lisp :tangle inits/60-vdiff.el
(use-package vdiff
  :straight t
  :config
  (define-key vdiff-mode-map (kbd "C-c") vdiff-mode-prefix-map)
    ;; automatically highlight word differences
  (setq vdiff-auto-refine t)
)

;; use vdiff on magit instead of ediff
;; (use-package vdiff-magit
;;   :straight t
;;   :bind (:map magit-mode-map
;;               ("e" . vdiff-magit-dwim)
;;               ("E" . vdiff-magit))
;;   :config
;;   (transient-suffix-put 'magit-dispatch "e" :description "vdiff (dwim)")
;;   (transient-suffix-put 'magit-dispatch "e" :command 'vdiff-magit-dwim)
;;   (transient-suffix-put 'magit-dispatch "E" :description "vdiff")
;;   (transient-suffix-put 'magit-dispatch "E" :command 'vdiff-magit))


(provide '60-vdiff)

#+end_src

* File: inits/60-vterm.el
#+begin_src emacs-lisp :tangle inits/60-vterm.el
;;;; --- VTERM CONFIGURATION ---

(if (eq system-type 'windows-nt)
    ;; ---------------------------------------------------------
    ;; WINDOWS (MSYS2/MINGW) CONFIGURATION
    ;; ---------------------------------------------------------
    (progn
      ;; 1. ENVIRONMENT SETUP
      ;; Tell bash it is a login shell to initialize MSYS2 environment.
      (setq explicit-bash-args '("--login" "--noediting" "-i"))

      ;; Set MSYS2 environment (e.g., UCRT64).
      (setq process-environment (nconc (list "MSYSTEM=UCRT64") process-environment))

      ;; Ensure MSYS2 binaries are in PATH.
      (add-to-list 'exec-path "C:/msys64/usr/bin")
      (add-to-list 'exec-path "C:/msys64/usr/local/bin")
      (add-to-list 'exec-path "C:/msys64/mingw64/bin")
      (add-to-list 'exec-path "C:/msys64/ucrt64/bin")

      ;; 2. FAKECYGPTY SETUP
      (use-package fakecygpty
        :straight (fakecygpty :host github
                              :repo "vleonbonnet/fakecygpty"
                              :branch "master")
        :init
        (fakecygpty-activate))

      ;; 3. VTERM PACKAGE (WINDOWS FORK)
      (use-package vterm
        :straight (vterm :host github :repo "vleonbonnet/emacs-libvterm")
        :config
        ;; Path to pre-compiled DLL
        (setq vterm-module-path "C:/Users/Mark/AppData/Roaming/git/emacs-libvterm/vterm-module.dll")

        ;; Specific shell executable
        (setq vterm-shell "C:/msys64/usr/bin/f_zsh.exe")
        (setq vterm-max-scrollback 100000)

        :bind (:map vterm-mode-map
                    ("C-y" . #'vterm-yank))))

  ;; ---------------------------------------------------------
  ;; LINUX / MACOS CONFIGURATION
  ;; ---------------------------------------------------------
  (progn
    (use-package vterm
      ;; Standard upstream repo
      :straight t
      :config
      (setq vterm-max-scrollback 100000)
      :bind (:map vterm-mode-map
                  ("C-y" . #'vterm-yank)))))

(provide '60-vterm)

#+end_src

* File: inits/60-whichkey.el
#+begin_src emacs-lisp :tangle inits/60-whichkey.el
;; show key completion
(use-package which-key
  :straight t
  :hook (after-init . which-key-mode))

(provide '60-whichkey)

#+end_src

* File: inits/60-whitespace.el
#+begin_src emacs-lisp :tangle inits/60-whitespace.el
;; Visualize and transform whitespace.
(use-package whitespace
  :straight t
  :after (company)
  :functions (my/on-off-whitespace-before-company)
  ;; :diminish whitespace-mode
  :custom (whitespace-line-column nil)  ; Set to fill-column.
  :config (progn (delete 'newline-mark whitespace-style) ; Don't paint $ at eol.
                 (delete 'lines whitespace-style) ; Don't mark whole long lines.
                 (when (< emacs-major-version 27) ; Mark end of too long lines.
                   (add-to-list 'whitespace-style 'lines-tail))

                 ;; Workaround to not show dots in popup menus.
                 (defvar-local my/ws-enabled nil)
                 (defun my/whitespace-mode-off ()
                   (setq-local my/ws-enabled whitespace-mode)
                   (when my/ws-enabled
                     (whitespace-mode -1)))
                 (defun my/whitespace-mode-on ()
                   (when my/ws-enabled
                     (whitespace-mode t)))
                 ;; company:
                 (defun my/on-off-whitespace-before-company (command)
                   (when (string= "show" command)
                     (my/whitespace-mode-off))
                   (when (string= "hide" command)
                     (my/whitespace-mode-on)))
                 (advice-add 'company-call-frontends
                             :before #'my/on-off-whitespace-before-company)
                 ;; popup:
                 (defadvice popup-create (before my/popup-suspend-ws activate)
                   "Suspend whitespace-mode while popups are visible."
                   (my/whitespace-mode-off))
                 (defadvice popup-delete (after my/popup-restore-ws activate)
                   "Restore whitespace-mode when all popups have closed."
                   (my/whitespace-mode-on))

                 (if (display-graphic-p)
                     (custom-set-faces
                      '(whitespace-line
                        ((t (:inherit whitespace-line
                                      :weight normal
                                      :foreground nil
                                      :background nil
                                      :box
                                      (:line-width 1 :color "dark red"))))))
                   (custom-set-faces    ; else
                    '(whitespace-line ((t (:inherit whitespace-line
                                                    :background nil
                                                    :underline t))))))

                 ;; Workaround for
                 ;; <https://debbugs.gnu.org/cgi/bugreport.cgi?bug=36837>, fixed
                 ;; in 28.1.
                 (defun my/ws-load-local-vars-first ()
                   "Loads fill-column before enabling whitespace-mode."
                   ;; We don't use 'lines-tail in Emacs >= 27.
                   (when (< emacs-major-version 27)
                     (hack-local-variables))
                   (whitespace-mode))

                 (defun my/ws-maybe-cleanup ()
                   "Run `whitespace-cleanup' if `my/reformat-save' is t."
                   (when my/reformat-save
                     (whitespace-cleanup))))
  :bind ("C-c w" . whitespace-mode)
  ;; :hook ((prog-mode   . my/ws-load-local-vars-first)
  ;;        (conf-mode   . my/ws-load-local-vars-first)
  ;;        (text-mode   . my/ws-load-local-vars-first))
  )


(use-package whitespace-cleanup-mode
  :straight t
  ;; :after (whitespace)
  ;; :init
  ;; (global-whitespace-cleanup-mode)
  :custom
  (whitespace-cleanup-mode-only-if-initially-clean t)
  :hook
  ((prog-mode . whitespace-cleanup-mode))
  ((yaml-mode . whitespace-cleanup-mode)))

(provide '60-whitespace)

#+end_src

* File: inits/60-windsize.el
#+begin_src emacs-lisp :tangle inits/60-windsize.el
;; resize windows with arrow keys
; https://www.emacswiki.org/emacs/download/lazy-set-key.el
(require 'lazy-set-key)
(use-package windsize
  :straight t
  :config
  (windsize-default-keybindings))

(provide '60-windsize)

#+end_src

* File: inits/60-yaml.el
#+begin_src emacs-lisp :tangle inits/60-yaml.el
(use-package yaml-mode
  :straight t
  :mode
  ("\\.yml$" . yaml-mode)
  ("\\.yaml$" . yaml-mode))

(provide '60-yaml)

#+end_src

* File: inits/60-yasnippet.el
#+begin_src emacs-lisp :tangle inits/60-yasnippet.el
(use-package yasnippet
  :straight t
  :diminish (yas-global-mode yas-minor-mode)
  :commands (yas-minor-mode)
  ;; :commands (yas-reload-all yas-minor-mode)
  :bind
  ((:map yas-minor-mode-map
         ("C-x i i" . yas-insert-snippet)
         ("C-x i n" . yas-new-snippet)
         ("C-x i v" . yas-visit-snippet-file)))
  :init
  (add-hook 'prog-mode-hook #'yas-minor-mode)
  :hook (prog-mode . yas-minor-mode)
  :config
  (setq yas-snippet-dirs '("~/drive/emacs/snippets"))
  (yas-initialize)
  (yas-reload-all)
  )

(use-package yasnippet-snippets
  :straight t
  :after (yasnippet)
  :config
  (add-to-list 'yas-snippet-dirs yasnippet-snippets-dir)
  )

(provide '60-yasnippet)

#+end_src

* File: inits/60-zeal.el
#+begin_src emacs-lisp :tangle inits/60-zeal.el
(use-package zeal-at-point
  :straight (zeal-at-point :host github
                           :repo "ns-mkusper/zeal-at-point"
                           :local-repo "ns-mkusper/zeal-at-point"
                           :branch "master"
                           )
  :bind
  ("\C-cz" . 'zeal-at-point)
  :config
  (add-to-list 'zeal-at-point-mode-alist '(rustic-mode . "rust"))
  (add-to-list 'zeal-at-point-mode-alist '(gitlab-ci-mode . "gitlab-ci"))
  )

(provide '60-zeal)

#+end_src

