dotemacs.org
* File: inits/70-erc.el
#+begin_src emacs-lisp :tangle inits/70-erc.el
;; ** ERC
(use-package erc
  :straight t
  :commands (erc-tls erc)
  :bind (:map erc-mode-map
              ("\M-(" . insert-parentheses-sentence))
  :config
  (setq erc-server "irc.libera.chat"
        erc-port 6697
        erc-nick "nego"
        erc-user-full-name "Nego"
        erc-prompt-for-password t
        erc-track-shorten-start 6
        erc-autojoin-channels-alist '(("irc.libera.chat"
                                       "#org-mode" "#emacs"))
        erc-kill-buffer-on-part t
        erc-lurker-threshold-time 1800
        erc-hide-list '("NICK")
        erc-lurker-hide-list '("JOIN" "PART" "QUIT" "NICK")
        erc-track-exclude-types '("JOIN" "MODE" "NICK" "PART" "QUIT"
                                  "324" "329" "332" "333" "353" "477")
        ;; erc-track-visibility t
        ;; erc-track-when-inactive t
        erc-format-nick-function 'erc-format-@nick
        erc-auto-query 'bury
        erc-keywords nil))

(use-package erc-image
  :disabled
  :after erc
  :straight t
  :init
  (setq erc-image-inline-rescale 350)
  (add-to-list 'erc-modules 'image)
  (push 'button erc-modules)
  (push 'completion erc-modules)
  (erc-update-modules)
  :config
  (defun erc-image-create-image (file-name)
    "Create an image suitably scaled according to the setting of
'ERC-IMAGE-RESCALE."
    (let* ((positions (window-inside-absolute-pixel-edges))
           (width (- (nth 2 positions) (nth 0 positions)))
           (height (- (nth 3 positions) (nth 1 positions)))
           (image (create-image file-name))
           (dimensions (image-size image t))
           (imagemagick-p (and (fboundp 'imagemagick-types) 'imagemagick)))
                                        ; See if we want to rescale the image
      (if (and erc-image-inline-rescale
               (not (image-multi-frame-p image)))
          ;; Rescale based on erc-image-rescale
          (cond (;; Numeric: scale down to that size
                 (numberp erc-image-inline-rescale)
                 (let ((max-height (min (cdr dimensions)
                                        erc-image-inline-rescale
                                        (floor (* width (cdr dimensions))
                                               (car dimensions)))))
                   (if (> (floor (* max-height (car dimensions))
                                 (cdr dimensions))
                          width)
                       (create-image file-name imagemagick-p nil :width width)
                     (create-image file-name imagemagick-p nil :height max-height))))
                (;; 'window: scale down to window size, if bigger
                 (eq erc-image-inline-rescale 'window)
                 ;; But only if the image is greater than the window size
                 (if (or (> (car dimensions) width)
                         (> (cdr dimensions) height))
                     ;; Figure out in which direction we need to scale
                     (if (> width height)
                         (create-image file-name imagemagick-p nil :height  height)
                       (create-image file-name imagemagick-p nil :width width))
                   ;; Image is smaller than window, just give that back
                   image))
                (t (progn (message "Error: none of the rescaling options matched") image)))
        ;; No rescale
        image))))

(use-package erc-hl-nicks
  :straight t
  :after erc
  :hook (erc-mode . erc-hl-nicks-mode))

(provide 'erc)

#+end_src

* File: inits/70-solaire.el
#+begin_src emacs-lisp :tangle inits/70-solaire.el
(use-package solaire-mode
  :straight t
  :hook (after-init . solaire-global-mode))

#+end_src

* File: inits/70-theme.el
#+begin_src emacs-lisp :tangle inits/70-theme.el
;;  Colors
;; (use-package doom-themes
;;   :straight t
;;   :config
;;   ;; Global settings (defaults)
;;   (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
;;         doom-themes-enable-italic t) ; if nil, italics is universally disabled
;;   (load-theme 'doom-peacock t)

;;   ;; Enable flashing mode-line on errors
;;   (doom-themes-visual-bell-config)
;;   ;; Enable custom neotree theme (all-the-icons must be installed!)
;;   (doom-themes-neotree-config)
;;   ;; or for treemacs users
;;   (setq doom-themes-treemacs-theme "doom-colors") ; use "doom-colors" for less minimal icon theme
;;   (doom-themes-treemacs-config)
;;   ;; Corrects (and improves) org-mode's native fontification.
;;   (doom-themes-org-config)
;;   :custom-face
;;   (org-ellipsis ((t (:height 0.8 :inherit 'shadow))))
;;   (org-scheduled-previously ((t (:background "red")))))

;; https://gitlab.com/protesilaos/modus-themes
(use-package modus-themes
  :straight (modus-themes :type git
                          :host gitlab
                          :repo "protesilaos/modus-themes")
    :custom
    ;; Add all your customizations prior to loading the themes
    (modus-themes-italic-constructs t)
    (modus-themes-bold-constructs t)
    (modus-themes-region '(bg-only no-extend))
    (modus-themes-lang-checkers '(text-also background straight-underline))
    (modus-themes-paren-match '(bold))
    (modus-themes-mode-line '(moody accented))

    ;; :init
    ;; (modus-themes-load-themes)
    :config
    (modus-themes-select 'modus-vivendi)
    )

;; cursor color
;; (set-cursor-color "IndianRed1")

;; highlight current lines
(global-hl-line-mode 1)

;; ayu mode doesn't colorize variable names
;; (custom-theme-set-faces 'user
;;                         `(font-lock-variable-name-face ((t (:foreground "#29AAA1"))))
;;                         )

;; set org level colors
;; (custom-theme-set-faces 'user
;;                         `(org-level-1 ((t (:foreground "#bfe438"))))
;;                         `(org-level-2 ((t (:foreground "#29AAA1"))))
;;                         `(org-level-3 ((t (:foreground "#eec900"))))
;;                         `(org-level-4 ((t (:foreground "#01fcff"))))
;;                         `(org-level-5 ((t (:foreground "#00bbea"))))
;;                         `(org-level-6 ((t (:foreground "#c66f19"))))
;;                         `(org-level-7 ((t (:foreground "#11bfaa"))))
;;                         `(org-level-8 ((t (:foreground "#735875"))))
;;                         `(org-level-9 ((t (:foreground "#9d3d4d"))))
;;                         `(org-level-10 ((t (:foreground "#ff6503"))))
;;                         `(org-scheduled-today ((t (:foreground "#c3c0bb"))))
;;                         )

;; customize company (auto-complete) colors
(set-face-attribute
 'company-tooltip-selection nil :background "maroon" :foreground "#0d1017")

;; powerline and doom require full icon pack
(use-package nerd-icons
  :custom
  ;; The Nerd Font you want to use in GUI
  ;; "Symbols Nerd Font Mono" is the default and is recommended
  ;; but you can use any other Nerd Font if you want
  (nerd-icons-font-family "Symbols Nerd Font Mono"))

(use-package emojify
  :straight t
  :hook (erc-mode . emojify-mode)
  :commands emojify-mode)

(provide '70-theme)

#+end_src

